Pivot table allows to transform or reshape the data

Pandas pivot function is a less powerful function that does pivot without aggregation that can handle non-numeric data

The melt() function is used to unpivot a given DataFrame from wide format to long format

In [23]:
import pandas as pd

In [32]:
df = pd.DataFrame({
        "fruit": ["apple", "orange", "apple", "avocado", "orange"],
        "customer": ["ben", "alice", "ben", "josh", "steve"],
        "quantity": [1, 2, 3, 1, 2]
    })

df

     fruit customer  quantity
0    apple      ben         1
1   orange    alice         2
2    apple      ben         3
3  avocado     josh         1
4   orange    steve         2

In [65]:
# if you use pivot function it will give error as it doesnt do any aggregation function


# df.pivot(index="fruit", columns="customer", values="quantity")

In [39]:
df.pivot_table(index="fruit", columns="customer", values="quantity", aggfunc=np.sum, fill_value=0.0)

customer  alice  ben  josh  steve
fruit
apple         0    4     0      0
avocado       0    0     1      0
orange        2    0     0      2

Multiple statistics on pivoted table

In [40]:
df.pivot_table(index="fruit", columns="customer", values="quantity", aggfunc=[np.sum, np.mean], fill_value=0)

           sum                 mean
customer alice ben josh steve alice ben josh steve
fruit
apple        0   4    0     0     0   2    0     0
avocado      0   0    1     0     0   0    1     0
orange       2   0    0     2     2   0    0     2

**Melt function**

In [41]:
df_melt = pd.DataFrame({
        'Item': ['Cereals', 'Dairy', 'Frozen', 'Meat'],
        'Price': [100, 50, 200, 250],
        'Hour_1': [5, 5, 3, 8],
        'Hour_2': [8, 8, 2, 1],
        'Hour_3': [7, 7, 8, 2]
    })
df_melt

      Item  Price  Hour_1  Hour_2  Hour_3
0  Cereals    100       5       8       7
1    Dairy     50       5       8       7
2   Frozen    200       3       2       8
3     Meat    250       8       1       2

In [47]:
melt_df = df_melt.melt(id_vars='Item',value_vars=('Hour_1','Hour_2','Hour_3'),var_name='Hour', value_name='Sales')
melt_df

       Item    Hour  Sales
0   Cereals  Hour_1      5
1     Dairy  Hour_1      5
2    Frozen  Hour_1      3
3      Meat  Hour_1      8
4   Cereals  Hour_2      8
5     Dairy  Hour_2      8
6    Frozen  Hour_2      2
7      Meat  Hour_2      1
8   Cereals  Hour_3      7
9     Dairy  Hour_3      7
10   Frozen  Hour_3      8
11     Meat  Hour_3      2

In [53]:
melt_df.groupby('Item')['Sales'].sum()

Item
Cereals    20
Dairy      20
Frozen     13
Meat       11
Name: Sales, dtype: int64

In [54]:
melt_df.groupby('Hour')['Sales'].sum()

Hour
Hour_1    21
Hour_2    19
Hour_3    24
Name: Sales, dtype: int64

In [59]:
melt_df1 = df_melt.melt(id_vars=['Item','Price'], 
    value_vars=('Hour_1','Hour_2','Hour_3'), 
    var_name='Hour', 
    value_name='Sales', 
    col_level=None
)
melt_df1

       Item  Price    Hour  Sales
0   Cereals    100  Hour_1      5
1     Dairy     50  Hour_1      5
2    Frozen    200  Hour_1      3
3      Meat    250  Hour_1      8
4   Cereals    100  Hour_2      8
5     Dairy     50  Hour_2      8
6    Frozen    200  Hour_2      2
7      Meat    250  Hour_2      1
8   Cereals    100  Hour_3      7
9     Dairy     50  Hour_3      7
10   Frozen    200  Hour_3      8
11     Meat    250  Hour_3      2

In [61]:
melt_df1['Revenue'] = melt_df1['Price'] * melt_df1['Sales']

In [63]:
melt_df1.groupby('Hour')['Revenue'].sum()

Hour
Hour_1    3350
Hour_2    1850
Hour_3    3150
Name: Revenue, dtype: int64

In [64]:
melt_df1.groupby('Item')['Revenue'].sum()

Item
Cereals    2000
Dairy      1000
Frozen     2600
Meat       2750
Name: Revenue, dtype: int64